simulation_data/refCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    velocity_inlet    
    {
        type            zeroGradient;
    }

    pressure_outlet 
    {
        type            fixedValue;
        value           uniform 0;
    }

    wall_rod
    {
        type            zeroGradient;
    }

    "top|bottom"
    {
        type            cyclic;
    }

    "periodic_.*"
    {
        type            cyclic;
    }
}

// ************************************************************************* //
